import { Post } from "@/app/interface";

import image1 from "../public/image/post/summer-finals-2024-day-1.jpg";
import image2 from "../public/image/post/random-pairs-2024.jpg";
import image3 from "../public/image/post/summer-finals-announcement-2024.png";
import image4 from "../public/image/post/summer-finals-2024-day-2.png";

const posts: Post[] = [
  {
    id: 1,
    title: "Случайные пары 2024",
    description:
      "Результаты второго парного турнира «Случайные пары 2024», прошедшего в Новосибирске, на микрорайоне Европейский Берег 20 июля 2024 года.",
    slug: "random-pairs-2024",
    author: "Глеб Фокин",
    content: `
# Второй парный турнир по настольному теннису

20 июля 2024 года в Новосибирске, на микрорайоне Европейский Берег состоялся второй парный турнир «Случайные пары 2024». Участие приняли 16 спортсменов, которые сформировали 8 пар. Турнир стартовал в 10:30 и завершился в 13:30. Участники столкнулись со множеством захватывающих и напряженных моментов, демонстрируя свои навыки и мастерство на высшем уровне.

> Турнир показал, насколько многострастен и захватывающ настольный теннис, объединяя более профессиональных участников и новичков.

## Групповой этап

### Группа А
- 1-е место: [Глеб Фокин](/players/7) и [Дмитрий Гондюхин](/players/20)
- 2-е место: [Вадим Боженов](/players/35) и [Антон Катренко](/players/23)
- 3-е место: [Наталья Рыжкова](/players/27) и [Виктория Емельянова](/players/2)
- 4-е место: [Дмитрий Куртеков](/players/5) и Игорь Соловьев

### Группа Б
- 1-е место: [Наталья Зайцева](/players/4) и Алексей Егоров
- 2-е место: Марина Воробьева и [Николай Соловьев](/players/18)
- 3-е место: Виктор Иванов и [Кирилл Козюрин](/players/24)
- 4-е место: [Евгений Шкретов](/players/8) и Абулиев Алихан

## Полуфиналы

### Первый полуфинал
Глеб Фокин и Дмитрий Гондюхин сразились с Мариной Воробьевой и Николаем Соловьевым. В напряженном поединке победу одержали Марина и Николай со счётом **0:3**.

### Второй полуфинал
Вадим Баженов и Антон Катренко встретились с Натальей Зайцевой и Алексеем Егоровым. Игра выдалась на редкость ожесточенной, и победу одержали Наталья и Алексей – со счётом **2:3**.

## Финал

В финале Наталья Зайцева и Алексей Егоров встретились с Мариной Воробьевой и Николаем Соловьевым. Демонстрируя уверенную игру, Наталья и Алексей одержали победу со счётом **3:0** и завоевали золотые медали турнира.

## Матч за третье место

Глеб Фокин и Дмитрий Гондюхин сразились с Вадимом Баженовым и Антоном Катренко. В захватывающей игре Глеб и Дмитрий одержали победу со счётом **3:2**, обеспечив себе почётное третье место.

## Конкурс плакатов

Виктория Емельянова продемонстрировала свои творческие способности и победила в конкурсе на лучший плакат. Её работа порадовала всех своим креативом и яркостью, став символом этого турнира.

![Победитель конкурса постеров](/image/post/poster.png)

## Примечательные моменты

- К сожалению, не все участники справились с эмоциональным давлением турнира: двое игроков сошли с дистанции, не доиграв групповые игры.
- Для Натальи Зайцевой победа в этом турнире стала четвёртым золотом в карьере.

## Итоги турнира

- 🥇 Наталья Зайцева и Алексей Егоров
- 🥈 Марина Воробьева и Николай Соловьев
- 🥉 Глеб Фокин и Дмитрий Гондюхин

![Победители турнира](/image/post/random-pairs-2024.jpg)
  `,
    image: image2,
    date: new Date("2024-07-20"),
  },
  {
    id: 2,
    title: "Анонс финалов летнего турнира по настольному теннису 2024",
    description:
      "Приглашаем всех на финалы летнего турнира по настольному теннису Европейского Берега, которые пройдут 17 и 18 августа 2024 года.",
    slug: "summer-finals-announcement-2024",
    author: "Глеб Фокин",
    content: `
![Фото](/image/post/summer-finals-announcement-2024.png)
# Анонс финалов летнего турнира по настольному теннису 2024

Микрорайон Европейский Берег вновь готовится к грандиозному событию — финалам летнего турнира по настольному теннису 2024 года. Групповой этап почти завершен, и впереди нас ждет кульминация этого спортивного праздника.

Третий по счету турнир собрал под своим знаменем множество талантливых спортсменов, и в этот раз их стремление к победе возросло многократно. Оставшиеся 53 игры станут последним шагом перед финальными баталиями, которые пройдут 17 и 18 августа, при условии благоприятной погоды.



## Финалисты

На этот раз определились 7 из 8 участников финалов Золотой лиги: Алексей Михалевич, Евгений Шкретов, Антон Тимочкин, Наталья Зайцева, Дмитрий Куртеков, Роман Аникин. За последнее, 8-е место, развернется напряженная борьба между Глебом Фокиным, Артемом Шаламовым и Вадимом Боженовым.

В этом году борьба в Золотой лиге заметно обострилась: из участников прошлого года в Золотой лиге остались только Дмитрий Куртеков, Наталья Зайцева и Евгений Шкретов. Остальные лидеры прошлого сезона теперь сражаются в Серебряной лиге, что говорит о высоком уровне конкуренции и мастерства всех участников.

## Формат финалов

Напомним, что распределение по лигам происходит следующим образом: лучшие восемь участников группового этапа входят в Золотую лигу, игроки, занявшие места с 9 по 16, — в Серебряную, с 17 по 24 — в Бронзовую лигу.

Финальная часть турнира проводится в формате двухдневного состязания, в котором каждый участник получит возможность проявить себя. Первый день отведен для групповых этапов, где игроки разделены на две группы по 4 человека. Из каждой группы по два лучших игрока выходят в 1/2 финала. Второй день будет посвящен финалам и матчу за третье место. Остальные участники займут 5-е место в своей лиге.

Среди участников Серебряной лиги уже известны имена таких спортсменов как Кирилл Ролдугин, Виктор Герасимов, Антон Шестернин и Илья Исаев. За возможность попасть в Серебряную лигу продолжат борьбу Анастасия Тамбовцева, Константин Назимов и Дмитрий Гондюхин.

## Призы и Награды

Победители турнира будут отмечены медалями и грамотами, но самое главное, что ожидает финалистов — это неоценимый респект и признание со стороны всех участников и зрителей.

## Важно Знать

Дата проведения финалов — 17 и 18 августа 2024 года. Пожалуйста, освободите эти дни для игр. В случае плохой погоды, турниры будут перенесены на другие даты.
`,
    image: image3,
    date: new Date("2024-07-30"),
  },
  {
    id: 3,
    title: "Финал летнего турнира 2024. День 1",
    description: "Кто смог пройти в полуфинал, а кто ушел тренироваться дальше",
    slug: "summer-finals-2024-day-1",
    author: "Глеб Фокин",
    content: `
# Финал летнего турнира 2024

17 августа 2024 года прошел групповой этап финалов Летнего Турнира 2024.  
По результатам [группового этапа](/tournament/1) мы сформировали три лиги:

- Золотую - с 1 по 8 место
- Серебряную - с 9 по 16 место
- Бронзовую - с 17 по 24 место

[Максим Ефименко](/players/16) по итогам группы занял 16 место, но не смог поучаствовать в финалах Серебряной лиги, поэтому на его 8 место в Серебряной лиге мы организовали Wild Card соревнование. Поучаствовать в Wild Card мы позвали лучших 4 игроков из Бронзовой лиги. Из-за общего сдвига турнирной таблицы на 1 позицию вверх, мы также организовали Wild Card в Бронзовой лиге.

В групповом этапе финала мы разделили всех участников каждой лиги на две подгруппы по четыре человека. Каждая подгруппа играла матчи каждый с каждым за выход в полуфинал.

## Регламент

- Правила ITTF
- Играем до трех побед
- Пауза между партиями — 1 минута
- Во время матча можно взять тайм-аут на 1 минуту
- Первая разминка — 7 минут, повторные разминки — 3 минуты
- Судейство — средне-строгое

## Wild Card

Разыгрывать Wild Card начали в половину десятого утра, но игры несколько раз откладывали из-за дождя. В итоге четыре матча играли почти два часа.

К участию в Wild Card за 8 место в Серебряной лиге заявились только двое участников из возможных, результаты:

- [Тамбовцева](/players/30) **3** — 2 [Назимов](/players/9)

За 8 место в Серебряной лиге сражались все четверо, играли на выбывание, результаты:

- [Катренко](/players/23) **3** — 0 [Соболев](/players/29)
- [Козюрин](/players/24) **3** — 0 [Рыжкова](/players/27)
- [Катренко](/players/23) **3** — 0 [Козюрин](/players/24)

## Церемония открытия

После того как определился состав участников всех трех лиг, прошла церемония открытия финалов. Женя Шкретов и Наталья Зайцева сказали речь, мы сфотографировались и начали играть.
![/image/post/opening-v2.jpg](/image/post/opening-v2.jpg)

## Бронзовая лига

В группе А была дикая заруба, в результате которой трое игроков вышли с равным количеством очков. Итоговые места считали по правилам [ITTF, страница 59](http://www.rustt.ru/b/fils/0/2021-table-tennis-rules.pdf). По соотношению побед/поражений в полуфинал вышли Костя Назимов и Виталий Хомич.

В группе Б ситуация была более спокойная. Максим Егоров и Никита Рабчевский не смогли набрать свои очки, и в финал вышли Дима Гондюхин и Коля Соловьев.

Игры Бронзовой лиги мы играли два с половиной часа, в процессе все время было пасмурно, иногда шел небольшой дождь.


### Группа А

- 1 место - [Назимов](/players/9), 2 очка
- 2 место - [Хомич](/players/26), 2 очка
- 3 место - [Рогозин](/players/15), 2 очка
- 4 место - [Катренко](/players/23), 0 очков

### Группа Б

- 1 место - [Соловьев](/players/18), 3 очка
- 2 место - [Гондюхин](/players/20), 2 очка
- 3 место - [Егоров](/players/19), 0 очков
- 4 место - [Рабчевский](/players/21), 0 очков

![/image/post/bronze-table.png](/image/post/bronze-table.png)

## Серебряная лига

Серебряная лига по составу участников получилась очень однородной — уровень всех игроков был практически одинаковый и результат игр казался самый непредсказуемый.

На деле игры прошли относительно спокойно.

В группе А Илья Исаев и Артем Шаламов уверенно забрали свои победы и вышли в полуфинал. В группе Б накал страстей был чуть выше, и в финальной игре "Боженов - Ачкасов" за второе место в группе со счетом 3-2 победил Вадим Боженов.

Группы Серебряной лиги играли два часа пятнадцать минут; в процессе светило солнышко, был небольшой ветер.


### Группа А

- 1 место - [Исаев](/players/28), 2 очка
- 2 место - [Шаламов](/players/6), 2 очка
- 3 место - [Герасимов](/players/17), 1 очко
- 4 место - [Тамбовцева](/players/30), 0 очков

### Группа Б

- 1 место - [Ролдугин](/players/13), 3 очка
- 2 место - [Боженов](/players/35), 2 очка
- 3 место - [Ачкасов](/players/14), 1 очко
- 4 место - [Шестернин](/players/10), 0 очков

![/image/post/silver-table.png](/image/post/silver-table.png)

## Золотая лига

В группе А Золотой лиги, как и в Бронзовой, три участника набрали по 2 очка, и итоговые места распределялись исходя из соотношения побед и поражений в сыгранных между собой партиях. В результате в полуфинал прошли Женя Шкретов и Наталья Зайцева.

Примечательной была последняя игра в группе между Фокиным и Зайцевой: для Наташи это фактически была игра за второе место в группе, а для Глеба — битва за респект.

В группе Б Роман Аникин уверенно забрал все свои игры и вышел с первого места. Самая напряженная игра для Ромы была с Викой: он выигрывал 2:0, но третью победу смог забрать только в пятой партии.

Емельянова и Тимочкин играли матч за 2 место в группе, в итоге победу забрала Вика.

Разминка Золотой лиги началась с резкого, порывистого ветра. Участники обсуждали перенос игр, но все-таки решили играть как есть. Во время игр ветер утих, и они прошли более-менее нормально.

Группы Золотой лиги играли два часа двадцать минут.


### Группа А

- 1 место - [Шкретов](/players/8), 2 очка
- 2 место - [Зайцева](/players/4), 2 очка
- 3 место - [Михалевич](/players/1), 2 очка
- 4 место - [Фокин](/players/7), 0 очков

### Группа Б

- 1 место - [Аникин](/players/11), 2 очка
- 2 место - [Емельянова](/players/2), 2 очка
- 3 место - [Тимочкин](/players/3), 1 очко
- 4 место - [Куртеков](/players/5), 0 очков

![/image/post/gold-table.png](/image/post/gold-table.png)

## Итого

Этот день задумывался организаторами как праздник тенниса, и так оно и получилось.

Завтра этот праздник продолжится 🎉

![/image/post/gleb.jpg](/image/post/gleb.jpg)
`,
    image: image1,
    date: new Date("2024-08-17"),
  },
  {
    id: 4,
    title: "Финал летнего турнира 2024. День 2",
    description: "Кто смог забрать кубок, а кто остался без медалей",
    slug: "summer-finals-2024-day-2",
    author: "Глеб Фокин",
    content: `
# Финал летнего турнира 2024

18 августа погода была пасмурная, с самого утра то собирался, то прекращался небольшой дождик. 

Игры полуфиналов были запланированы на 10 часов утра, поэтому к 9 часам к столам начал подтягиваться оргкомитет, а участники начали разминаться примерно в половину десятого. 

Матчи полуфиналов и финалов договорились играть до 4 побед. Полуфиналы играли параллельно на двух столах, а матчи за третье место и финалы — на одном.

![Зрители](/image/post/summer-finals-2024-day-2/rain.png)

## Бронза

Во втором полуфинале интрига сохранялась до самого конца: Виталий выиграл первые две партии, но проиграл встречу со счётом 4:3. 

В пятой партии финала Костя Назимов совершил впечатляющий камбэк, отыгрался с 3:10 и выиграл партию, однако выиграть встречу в итоге не смог.

<PlayoffTable stages='[{"name":"Полуфинал","matches":[{"player1":{"id":9,"name":"Назимов","score":4},"player2":{"id":20,"name":"Гондюхин","score":0}},{"player1":{"id":18,"name":"Соловьев","score":4},"player2":{"id":26,"name":"Хомич","score":3}}]},{"name":"Третье место","matches":[{"player1":{"id":20,"name":"Гондюхин","score":4},"player2":{"id":26,"name":"Хомич","score":3}}]},{"name":"Финал","matches":[{"player1":{"id":18,"name":"Соловьев","score":4},"player2":{"id":9,"name":"Назимов","score":2}}]}]' />

## Серебро

В полуфинале Илья Исаев уверенно выиграл Вадима Боженова со счётом 4:1, а Кирилл Ролдугин забрал место в финале у Артёма Шаламова.

В финале Илья не оставил шансов сопернику и стал победителем серебряной лиги с итоговым счётом 4:1.

<PlayoffTable stages='[{"name":"Полуфинал","matches":[{"player1":{"id":28,"name":"Исаев","score":4},"player2":{"id":35,"name":"Боженов","score":1}},{"player1":{"id":13,"name":"Ролдугин","score":4},"player2":{"id":6,"name":"Шаламов","score":2}}]},{"name":"Третье место","matches":[{"player1":{"id":6,"name":"Шаламов","score":4},"player2":{"id":35,"name":"Боженов","score":2}}]},{"name":"Финал","matches":[{"player1":{"id":28,"name":"Исаев","score":4},"player2":{"id":13,"name":"Ролдугин","score":1}}]}]' />

## Золото

Оба полуфинала были крайне напряжёнными.

В первом полуфинале, в пятой партии (2:2), Вика взяла тайм-аут при счёте 9:6 и выиграла партию 16:14, что позволило ей выйти в финал. Во втором полуфинале Роман вёл со счётом 3:1, но Наташа смогла собраться и забрала встречу со счётом 4:3.

Финал прошёл в напряжённой борьбе: счёт менялся от 1:0 до 4:2 в пользу Вики, которая в итоге одержала победу.

<PlayoffTable stages='[{"name":"Полуфинал","matches":[{"player1":{"id":4,"name":"Зайцева","score":4},"player2":{"id":11,"name":"Аникин","score":3}},{"player1":{"id":2,"name":"Емельянова","score":4},"player2":{"id":8,"name":"Шкретов","score":2}}]},{"name":"Третье место","matches":[{"player1":{"id":8,"name":"Шкретов","score":4},"player2":{"id":11,"name":"Аникин","score":3}}]},{"name":"Финал","matches":[{"player1":{"id":2,"name":"Емельянова","score":4},"player2":{"id":4,"name":"Зайцева","score":2}}]}]' />

## Итоги

![Победители](/image/post/summer-finals-2024-day-2/winners.png)

— Победителем бронзовой лиги стал **Николай Соловьёв**.

— Победителем серебряной лиги стал **Илья Исаев**.

— Победителем золотой лиги стала **Вика Емельянова**.

В этом году выросло количество и качество участников нашего регулярного летнего турнира.

В прошлом году 27 человек из 32 заявившихся доиграли турнир, в этом году до конца турнира дошли уже 32 человека при 40 заявившихся.

Золотая, серебряная и бронзовая лиги пополнились новыми игроками: четверо новеньких в золоте, двое в серебре и трое в бронзе.

Второй год подряд новичок забирает кубок золотой лиги у прошлогоднего чемпиона в финале:
* в 2022 году чемпионом был Женя Шкретов;
* в 2023 году Наташа Зайцева выиграла финал у Жени;
* в 2024 году Вика Емельянова выиграла финал у Наташи.

Турнир 2024 года получился насыщенным, спортивным и уютным.

Благодарю всех участников, с вами было классно играть и тусоваться!

![Фото с вечеринки](/image/post/summer-finals-2024-day-2/valgala.png)
    `,
    image: image4,
    date: new Date("2024-08-27"),
  },
];

export class PostService {
  constructor() {}
  async getPostBySlug(slug: string): Promise<Post | undefined> {
    return posts.find((post) => post.slug === slug);
  }
  async getAllPosts(): Promise<Post[]> {
    return posts;
  }
}
